## CRUD operations

When we talk about 'CRUD' operations on the records of a database, what do we mean - what do those letters stand for?

Create, Read, Update, Delete.

## Create tables

Say you want to create a table to consolidate some useful track information into one table. This will consist of the track name, the artist, and the album the track came from. You also want to store the track length in a different format to how it is currently stored in the track table. How can you go about doing this? Using `CREATE TABLE`. Recall the example from the video:

```
CREATE TABLE test_table(
    test_date DATE, 
    test_name VARCHAR(20), 
    test_int INT)
```

Let's get started!

Instructions

1. Create a table named `'results'` with 3 `VARCHAR` columns called `track`, `artist`, and `album`, with lengths `200`, `120`, and `160`, respectively.
2. Create one integer column called `track_length_mins`.
3. `SELECT` all the columns from your new table. No rows will be returned, but you can confirm that the table has been created.

In [ ]:
-- Create the table
CREATE TABLE results(
    -- Create track column
    track VARCHAR(200),
    -- Create artist column
    artist VARCHAR(120),
    -- Create album column
    album VARCHAR(160));

In [ ]:
-- Create the table
CREATE TABLE results(
    -- Create track column
    track VARCHAR(200),
    -- Create artist column
    artist VARCHAR(120),
    -- Create album column
    album VARCHAR(160),
    -- Create track_length_mins
    track_length_mins INT);

In [ ]:
-- Select all columns from the table
SELECT track,
       artist, 
       album, 
       track_length_mins 
FROM results;

# track   artist   album   track_length_mins

## Insert

This exercise consists of two parts: In the first, you'll create a new table very similar to the one you created in the previous interactive exercise. After that, you'll insert some data and retrieve it.

You'll continue working with the Chinook database here.

Instructions

1. Create a table called `tracks` with 2 `VARCHAR` columns named `track` and `album`, and one integer column named `track_length_mins`. Then, select all columns from the new table using the `*` notation.
2. Insert the track `'Basket Case'`, from the album `'Dookie'`, with a track length of `3`, into the appropriate columns.

In [ ]:
-- Create the table
CREATE TABLE tracks(
    -- Create track column
    track VARCHAR(200),
    -- Create album column
    album VARCHAR(160),
    -- Create track_length_mins column
    track_length_mins INT);
-- Select all columns from the new table
SELECT * 
FROM tracks;

# track   album   track_length_mins

In [ ]:
-- Create the table
CREATE TABLE tracks(
  -- Create track column
  track VARCHAR(200), 
  -- Create album column
  album VARCHAR(160), 
  -- Create track_length_mins column
  track_length_mins INT);
-- Complete the statement to enter the data to the table         
INSERT INTO tracks
-- Specify the destination columns
(track, album, track_length_mins)
-- Insert the appropriate values for track, album and track length
VALUES ('Basket Case', 'Dookie', 3);
-- Select all columns from the new table
SELECT *
FROM tracks;

# track         album    track_length_mins
# Basket Case   Dookie   3

## Update

You may sometimes have to update the rows in a table. For example, in the `album` table, there is a row with a very long album title, and you may want to shorten it.

You don't want to delete the record - you just want to update it in place. To do this, you need to specify the `album_id` to ensure that only the desired row is updated and all others are not modified.

Instructions

1. Select the `title` column from the `album` table where the `album_id` is `213`.
2. That's a very long album title, isn't it? Use an `UPDATE` statement to modify the `title` to `'Pure Cult: The Best Of The Cult'`.
3. Check to see whether or not the album title was shortened!

In [ ]:
-- Select the album
SELECT title 
FROM album 
WHERE album_id = 213;

# title
# Pure Cult: The Best Of The Cult (For Rockers Ravers Lovers & Sinners) UK

In [ ]:
-- Run the query
SELECT title 
FROM album 
WHERE album_id = 213;
-- UPDATE the album table
UPDATE album
-- SET the new title    
SET title = 'Pure Cult: The Best Of The Cult'
WHERE album_id = 213;

In [ ]:
-- Select the album
SELECT title 
FROM album 
WHERE album_id = 213;
-- UPDATE the title of the album
UPDATE album 
SET title = 'Pure Cult: The Best Of The Cult' 
WHERE album_id = 213;
-- Run the query again
SELECT title 
FROM album
WHERE album_id = 213;

# title
# Pure Cult: The Best Of The Cult

## Delete

You may not have permissions to delete from your database, but it is safe to practice it here in this course!

Remember - there is no confirmation before deleting. When you execute the statement, the record(s) are deleted immediately. Always ensure you test with a `SELECT` and `WHERE` in a separate query to ensure you are selecting and deleting the correct records. If you forget so specify a `WHERE` condition, you will delete ALL rows from the table.

Instructions

1. Check the query and view the existing data.
2. `DELETE` the record from `album` where `album_id` is `1` and then check.

In [ ]:
-- Run the query
SELECT * 
FROM album

# album_id   title                                   artist_id
# 1          For Those About To Rock We Salute You   1
# 2          Balls to the Wall                       2
# 3          Restless and Wild                       2
# ...

In [ ]:
-- Run the query
SELECT * 
FROM album 
-- DELETE the record
DELETE FROM album 
WHERE album_id = 1
  -- Run the query again
SELECT * 
FROM album;

# album_id   title               artist_id
# 2          Balls to the Wall   2
# 3          Restless and Wild   2
# 4          Let There Be Rock   1
# ...

## DECLARE and SET a variable

Using variables makes it easy to run a query multiple times, with different values, without having to scroll down and amend the `WHERE` clause each time. You can quickly update the variable at the top of the query instead. This also helps provide greater security, but that is out of scope of this course.

Let's go back to the now very familiar `grid` table for this exercise, and use it to practice extracting data according to your newly defined variable.

Instructions

1. `DECLARE` the variable `@region`, which has a data type of `VARCHAR` and length of `10`.
2. `SET` your newly defined variable to `'RFC'`.
3. Check the results!

In [ ]:
-- Declare the variable @region, and specify the data type of the variable
DECLARE @region VARCHAR(10)

-- Update the variable value
SET @region = 'RFC'

SELECT description,
       nerc_region,
       demand_loss_mw,
       affected_customers
FROM grid
WHERE nerc_region = @region;

# description                     nerc_region   demand_loss_mw   affected_customers
# Severe Weather  Thunderstorms   RFC           null             127000
# Severe Weather  Thunderstorms   RFC           null             138802
# Severe Weather  Thunderstorms   RFC           null             66383
# ...

## Declare multiple variables

You've seen how to `DECLARE` and `SET` set 1 variable. Now, you'll `DECLARE` and `SET` multiple variables. There is already one variable declared, however you need to overwrite this and declare 3 new ones. The `WHERE` clause will also need to be modified to return results between a range of dates.

Instructions

1. Declare a new variable called `@start` of type `DATE`.
2. Declare a new variable called `@stop` of type `DATE`.
3. Declare a new variable called `@affected` of type `INT`.
4. Retrieve all rows where `event_date` is `BETWEEN` `@start` and `@stop` and `affected_customers` is greater than or equal to `@affected`.

In [ ]:
-- Declare @start
DECLARE @start DATE

-- SET @start to '2014-01-24'
SET @start = '2014-01-24'

In [ ]:
-- Declare @stop
DECLARE @stop DATE

-- SET @stop to '2014-07-02'
SET @stop = '2014-07-02'

In [ ]:
-- Declare @affected
DECLARE @affected INT

-- Set @affected to 5000
SET @affected = 5000

In [ ]:
SELECT description,
       nerc_region,
       demand_loss_mw,
       affected_customers
FROM grid
-- Specify the date range of the event_date and the value for @affected
WHERE event_date BETWEEN @start AND @stop
AND affected_customers >= @affected;

# description                     nerc_region   demand_loss_mw   affected_customers
# Severe Weather  Thunderstorms   RFC           null             127000
# Severe Weather  Thunderstorms   MRO           424              120000
# Severe Weather  Thunderstorms   RFC           null             138802
# ...

## Ultimate Power

Sometimes you might want to 'save' the results of a query so you can do some more work with the data. You can do that by creating a temporary table that remains in the database until SQL Server is restarted. In this final exercise, you'll select the longest track from every album and add that into a temporary table which you'll create as part of the query.

Instructions

1. Create a temporary table called `maxtracks`. Make sure the table name starts with `#`.
2. Join `album` to `artist` using `artist_id`, and `track` to `album` using `album_id`.
3. Run the final `SELECT` statement to retrieve all the columns from your new table.

In [ ]:
SELECT  album.title AS album_title,
        artist.name as artist,
        MAX(track.milliseconds / (1000 * 60) % 60 ) AS max_track_length_mins
-- Name the temp table #maxtracks
INTO #maxtracks
FROM album
-- Join album to artist using artist_id
INNER JOIN artist ON album.artist_id = artist.artist_id
-- Join track to album using album_id
INNER JOIN track ON track.album_id = album.album_id
GROUP BY artist.artist_id, album.title, artist.name,album.album_id
-- Run the final SELECT query to retrieve the results from the temporary table
SELECT album_title, 
       artist,
       max_track_length_mins
FROM  #maxtracks
ORDER BY max_track_length_mins DESC, artist;

# album_title                               artist                           max_track_length_mins
# Battlestar Galactica (Classic) Season 1   Battlestar Galactica (Classic)   49
# Battlestar Galactica Season 3             Battlestar Galactica             47
# Lost Season 2                             Lost                             47
# ...